blog/21.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 2.4 Multiple Representations for Abstract Data
#+subtitle: 2023-09-27 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)

/Data Abstraction/ separates the /use/ from the /implementation/, the
/interface/ from the /representation/. A Scheme programmer, for
example, usually operates at a level of abstraction such that she
doesn't have to worry about how ~car~, ~cdr~, and ~cons~ are
/implemented/. She just has to know /how they behave/. She just has to
know that ~cons~ takes two entities and creates a further entity --- a
pair --- the application of ~car~ to which returns the first entity
and the application of ~cdr~ to which returns the second entity. When
we /use/ pairs, their /implementation/ remains in the shadows[fn::A
cool way to represent pairs using procedures only is shown on page
91.]. The programmer knows how to use pairs, but he doesn't
necessarily have to know how pairs are represented.

Section 2.1.1 showed an example of this kind of ``abstractions
barriers''. There we saw ``how to separate the task of designing a
program that uses rational numbers from the task of implementing
rational numbers. The ``abstractions barriers'' we are talking about
can be thought of as horizontal barriers which are present at
different levels (see Figure 2.1). In that specific example, there are
the following barriers:
- ~cons~, ~car~, ~cdr~;
- ~make-rat~, ~numer~, ~denom~;
- ~add-rat~, ~sub-rat~, etc.;
- programs that use rational numbers.

Despite the benefits that those barriers provide, those barriers are
not enough. They are not enough, because there might be more than one
useful representation for a certain data object and we might want to
use those different representations together in our system. Complex
numbers offer a more-or-less-toy example. Complex numbers can be
represented in the so-called ``rectangular'' form --- which is in
terms of a real part and an imaginary part ---, or in the so-called
``polar'' form --- which is in terms of a magnitude and an angle. Each
of those two representations can be, depending on the circumstances,
more appropriate than the other.

We need:
 - *not only*: ``data-abstraction barriers'' that isolate /use/ from
   /representation/, /interface/ from /implementation/,
 - *but also*: abstraction barriers that isolate different
   representations for the same data object and allow those different
   design choices to coexist.
 - *moreover*: we need to able to add a certain representation to a
   system /additively/, that is, without having to re-design or
   re-implement it.

We can think of those additional barriers as /vertical/ barriers:
#+begin_src 
     *Figure 2.19:* Data-abstraction barriers in the complex-number
     system.

                     Programs that use complex numbers
            +-------------------------------------------------+
          --| add-complex sub-complex mul-complex div-complex |--
            +-------------------------------------------------+
                        Complex arithmetic package
          ---------------------------+---------------------------
                    Rectangular      |         Polar
                  representation     |     representation
          ---------------------------+---------------------------
              List structure and primitive machine arithmetic

[Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007)]
#+end_src

Vertical barriers can be built through the usage of *generic
procedures*, ``procedures that can operate on data that may be
represented in more than one way''. We will be able to write generic
procedures thanks to the usage of /type tags/. To achieve the ability
to add representation to a certain system additively we will use the
technique of /data-directed/ programming. We will also briefly look
at an alternative to data-directed programming called /message
passing/.

