blog/21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-27 Wed 23:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 2.4 Multiple Representations for Abstract Data</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 2.4 Multiple Representations for Abstract Data
<br />
<span class="subtitle">2023-09-27 Wed</span>
</h1>
<p>
<i>Data Abstraction</i> separates the <i>use</i> from the <i>implementation</i>, the
<i>interface</i> from the <i>representation</i>. A Scheme programmer, for
example, usually operates at a level of abstraction such that she
doesn't have to worry about how <code>car</code>, <code>cdr</code>, and <code>cons</code> are
<i>implemented</i>. She just has to know <i>how they behave</i>. She just has to
know that <code>cons</code> takes two entities and creates a further entity &#x2014; a
pair &#x2014; the application of <code>car</code> to which returns the first entity
and the application of <code>cdr</code> to which returns the second entity. When
we <i>use</i> pairs, their <i>implementation</i> remains in the shadows<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. The programmer knows how to use pairs, but he doesn't
necessarily have to know how pairs are represented.
</p>

<p>
Section 2.1.1 showed an example of this kind of ``abstractions
barriers''. There we saw ``how to separate the task of designing a
program that uses rational numbers from the task of implementing
rational numbers. The ``abstractions barriers'' we are talking about
can be thought of as horizontal barriers which are present at
different levels (see Figure 2.1). In that specific example, there are
the following barriers:
</p>
<ul class="org-ul">
<li><code>cons</code>, <code>car</code>, <code>cdr</code>;</li>
<li><code>make-rat</code>, <code>numer</code>, <code>denom</code>;</li>
<li><code>add-rat</code>, <code>sub-rat</code>, etc.;</li>
<li>programs that use rational numbers.</li>
</ul>

<p>
Despite the benefits that those barriers provide, those barriers are
not enough. They are not enough, because there might be more than one
useful representation for a certain data object and we might want to
use those different representations together in our system. Complex
numbers offer a more-or-less-toy example. Complex numbers can be
represented in the so-called ``rectangular'' form &#x2014; which is in
terms of a real part and an imaginary part &#x2014;, or in the so-called
``polar'' form &#x2014; which is in terms of a magnitude and an angle. Each
of those two representations can be, depending on the circumstances,
more appropriate than the other.
</p>

<p>
We need:
</p>
<ul class="org-ul">
<li><b>not only</b>: ``data-abstraction barriers'' that isolate <i>use</i> from
<i>representation</i>, <i>interface</i> from <i>implementation</i>,</li>
<li><b>but also</b>: abstraction barriers that isolate different
representations for the same data object and allow those different
design choices to coexist.</li>
<li><b>moreover</b>: we need to able to add a certain representation to a
system <i>additively</i>, that is, without having to re-design or
re-implement it.</li>
</ul>

<p>
We can think of those additional barriers as <i>vertical</i> barriers:
</p>
<pre class="example">
     *Figure 2.19:* Data-abstraction barriers in the complex-number
     system.

                     Programs that use complex numbers
            +-------------------------------------------------+
          --| add-complex sub-complex mul-complex div-complex |--
            +-------------------------------------------------+
                        Complex arithmetic package
          ---------------------------+---------------------------
                    Rectangular      |         Polar
                  representation     |     representation
          ---------------------------+---------------------------
              List structure and primitive machine arithmetic

[Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007)]
</pre>

<p>
Vertical barriers can be built through the usage of <b>generic
procedures</b>, ``procedures that can operate on data that may be
represented in more than one way''. We will be able to write generic
procedures thanks to the usage of <i>type tags</i>. To achieve the ability
to add representation to a certain system additively we will use the
technique of <i>data-directed</i> programming. We will also briefly look
at an alternative to data-directed programming called <i>message
passing</i>.
</p>
