blog/21.org
* 2.4.1 Representations for Complex Numbers
We want a complex number arithmetic system. Basically we want four
operations that work with complex numbers: addition, subtraction,
multiplication, and division.

Using a data-abstraction strategy --- exactly what we did with
rational number) ---, we can just /assume/ that we have the following
selectors and constructors:
- Selectors:
  - ~real-part~;
  - ~imag-part~;
  - ~magnitude~;
  - ~angle~.
- Constructors:
  - ~make-from-real-imag~;
  - ~make-from-mag-ang~.

The selectors and constructors above are our /abstract data/. We can
specify operations on complex numbers in terms of that abstract data:
- ~add-complex~:
  #+begin_src scheme
    (define (add-complex z1 z2)
      (make-from-real-imag (+ (real-part z1) (real-part z2))
                           (+ (imag-part z1) (imag-part z2))))
  #+end_src
- ~sub-complex~:
  #+begin_src scheme
    (define (sub-complex z1 z2)
      (make-from-real-imag (- (real-part z1) (real-part z2))
                           (- (imag-part z1) (imag-part z2))))
  #+end_src
- ~mul-complex~:
  #+begin_src scheme
    (define (mul-complex z1 z2)
      (make-from-mag-ang (* (magnitude z1) (magnitude z2))
                         (+ (angle z1) (angle z2))))
  #+end_src
- ~div-complex~:
  #+begin_src scheme
    (define (div-complex z1 z2)
      (make-from-mag-ang (/ (magnitude z1) (magnitude z2))
                         (- (angle z1) (angle z2))))
  #+end_src

Now that we have the complex number arithmetic operations, we need
somebody to implement a complex number representation. Both Ben and
Alyssa want to do it and, for some reason --- pick your favorite
reason ---, we are forced to use both representations in our system.

Here is what Ben does:
#+begin_src scheme
  ;; Ben's representation
  (define (real-part z) (car z))

  (define (imag-part z) (cdr z))

  (define (magnitude z)
    (sqrt (+ (square (real-part z)) (square (imag-part z)))))

  (define (angle z)
    (atan (imag-part z) (real-part z)))

  (define (make-from-real-imag x y) (cons x y))

  (define (make-from-mag-ang r a)
    (cons (* r (cos a)) (* r (sin a))))
#+end_src

And here is what Alyssa does:
#+begin_src scheme
  ;; Alyssa's representation
  (define (real-part z)
    (* (magnitude z) (cos (angle z))))

  (define (imag-part z)
    (* (magnitude z) (sin (angle z))))

  (define (magnitude z) (car z))

  (define (angle z) (cdr z))

  (define (make-from-real-imag x y)
    (cons (sqrt (+ (square x) (square y)))
          (atan y x)))

  (define (make-from-mag-ang r a) (cons r a))
#+end_src

Ben has implemented what can be called a ``rectangular''
representation (in which a complex number is represented as a pair of
a real-part and an imaginary part), whereas Alyssa has implemented
what can be called a ``polar'' representation (in which a complex
number is represented as a pair of a magnitude and an angle). The
selectors and the constructors they have created have the same name,
operate differently underneath the hood.

Given that the operations ~add-complex~, ~sub-complex~, ~mul-complex~,
and ~div-complex~ are implemented in terms of abstract data, choosing
Ben's representation over Alyssa's, or vice versa, would make no
difference: those operations would work in both cases.

