blog/21.html

<div id="outline-container-org8f9f2de" class="outline-2">
<h2 id="org8f9f2de">2.4.1 Representations for Complex Numbers</h2>
<div class="outline-text-2" id="text-org8f9f2de">
<p>
We want a complex number arithmetic system. Basically we want four
operations that work with complex numbers: addition, subtraction,
multiplication, and division.
</p>

<p>
Using a data-abstraction strategy &#x2014; exactly what we did with
rational number) &#x2014;, we can just <i>assume</i> that we have the following
selectors and constructors:
</p>
<ul class="org-ul">
<li>Selectors:
<ul class="org-ul">
<li><code>real-part</code>;</li>
<li><code>imag-part</code>;</li>
<li><code>magnitude</code>;</li>
<li><code>angle</code>.</li>
</ul></li>
<li>Constructors:
<ul class="org-ul">
<li><code>make-from-real-imag</code>;</li>
<li><code>make-from-mag-ang</code>.</li>
</ul></li>
</ul>

<p>
The selectors and constructors above are our <i>abstract data</i>. We can
specify operations on complex numbers in terms of that abstract data:
</p>
<ul class="org-ul">
<li><p>
<code>add-complex</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add-complex</span> z1 z2)
  (make-from-real-imag (+ (real-part z1) (real-part z2))
                       (+ (imag-part z1) (imag-part z2))))
</pre>
</div></li>
<li><p>
<code>sub-complex</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sub-complex</span> z1 z2)
  (make-from-real-imag (- (real-part z1) (real-part z2))
                       (- (imag-part z1) (imag-part z2))))
</pre>
</div></li>
<li><p>
<code>mul-complex</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">mul-complex</span> z1 z2)
  (make-from-mag-ang (* (magnitude z1) (magnitude z2))
                     (+ (angle z1) (angle z2))))
</pre>
</div></li>
<li><p>
<code>div-complex</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">div-complex</span> z1 z2)
  (make-from-mag-ang (/ (magnitude z1) (magnitude z2))
                     (- (angle z1) (angle z2))))
</pre>
</div></li>
</ul>

<p>
Now that we have the complex number arithmetic operations, we need
somebody to implement a complex number representation. Both Ben and
Alyssa want to do it and, for some reason &#x2014; pick your favorite
reason &#x2014;, we are forced to use both representations in our system.
</p>

<p>
Here is what Ben does:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">Ben's representation</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part</span> z) (car z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part</span> z) (cdr z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z)
  (sqrt (+ (square (real-part z)) (square (imag-part z)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle</span> z)
  (atan (imag-part z) (real-part z)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag</span> x y) (cons x y))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang</span> r a)
  (cons (* r (cos a)) (* r (sin a))))
</pre>
</div>

<p>
And here is what Alyssa does:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">Alyssa's representation</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part</span> z)
  (* (magnitude z) (cos (angle z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part</span> z)
  (* (magnitude z) (sin (angle z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z) (car z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle</span> z) (cdr z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag</span> x y)
  (cons (sqrt (+ (square x) (square y)))
        (atan y x)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang</span> r a) (cons r a))
</pre>
</div>

<p>
Ben has implemented what can be called a ``rectangular''
representation (in which a complex number is represented as a pair of
a real-part and an imaginary part), whereas Alyssa has implemented
what can be called a ``polar'' representation (in which a complex
number is represented as a pair of a magnitude and an angle). The
selectors and the constructors they have created have the same name,
operate differently underneath the hood.
</p>

<p>
Given that the operations <code>add-complex</code>, <code>sub-complex</code>, <code>mul-complex</code>,
and <code>div-complex</code> are implemented in terms of abstract data, choosing
Ben's representation over Alyssa's, or vice versa, would make no
difference: those operations would work in both cases.
</p>
</div>
</div>
