blog/21.org
* 2.4.2 Tagged data
Now, what if don't want to choose one representation over the other?
What if we want to keep both representations? What if we want a system
that looks like that figure 2.19?

If our system has to include multiple representations for the same
object type, then we need some way to distinguish objects with
representation foo from objects with representation bar. A simple way
to do that is /tagging/ the objects. To tag and check the tags we can
do something like this:

#+begin_src scheme
  (define (attach-tag type-tag contents)
    (cons type-tag contents))

  (define (type-tag datum)
    (if (pair? datum)
        (car datum)
        (error "Bad tagged datum -- TYPE-TAG" datum)))

  (define (contents datum)
    (if (pair? datum)
        (cdr datum)
        (error "Bad tagged datum -- CONTENTS" datum)))

  (define (rectangular? z)
    (eq? (type-tag z) 'rectangular))

  (define (polar? z)
    (eq? (type-tag z) 'polar))
#+end_src

If Ben and Alyssa have a designed their representation packages
separately, what would they have to do to exist compatibly in the
system? Here is what they can do. Ben can write his representation in
this way:
#+begin_src scheme
  (define (real-part-rectangular z) (car z))

  (define (imag-part-rectangular z) (cdr z))

  (define (magnitude-rectangular z)
    (sqrt (+ (square (real-part-rectangular z))
             (square (imag-part-rectangular z)))))

  (define (angle-rectangular z)
    (atan (imag-part-rectangular z)
          (real-part-rectangular z)))

  (define (make-from-real-imag-rectangular x y)
    (attach-tag 'rectangular (cons x y)))

  (define (make-from-mag-ang-rectangular r a)
    (attach-tag 'rectangular
                (cons (* r (cos a)) (* r (sin a)))))
#+end_src

And Alyssa can write her representation in this way:
#+begin_src scheme
  (define (real-part-polar z)
    (* (magnitude-polar z) (cos (angle-polar z))))

  (define (imag-part-polar z)
    (* (magnitude-polar z) (sin (angle-polar z))))

  (define (magnitude-polar z) (car z))

  (define (angle-polar z) (cdr z))

  (define (make-from-real-imag-polar x y)
    (attach-tag 'polar
                (cons (sqrt (+ (square x) (square y)))
                      (atan y x))))

  (define (make-from-mag-ang-polar r a)
    (attach-tag 'polar (cons r a)))
#+end_src

These ``packages'' differ from the original packages in two respects:
1. the constructor is now tagging the objects it creates;
2. the function names have been modified in order to avoid name
   conflicts (for example, in Ben's representation, ~real-part~ has
   become ~real-part-rectangular~).

Now that we have been given typed data, we need somebody, say a
``manager'' (see lecture), that looks at those types and make things
work. The manager can now write /generic/ selectors:
#+begin_src scheme
  (define (real-part z)
    (cond ((rectangular? z)
           (real-part-rectangular (contents z)))
          ((polar? z)
           (real-part-polar (contents z)))
          (else (error "Unknown type -- REAL-PART" z))))

  (define (imag-part z)
    (cond ((rectangular? z)
           (imag-part-rectangular (contents z)))
          ((polar? z)
           (imag-part-polar (contents z)))
          (else (error "Unknown type -- IMAG-PART" z))))

  (define (magnitude z)
    (cond ((rectangular? z)
           (magnitude-rectangular (contents z)))
          ((polar? z)
           (magnitude-polar (contents z)))
          (else (error "Unknown type -- MAGNITUDE" z))))

  (define (angle z)
    (cond ((rectangular? z)
           (angle-rectangular (contents z)))
          ((polar? z)
           (angle-polar (contents z)))
          (else (error "Unknown type -- ANGLE" z))))
#+end_src

This strategy is called /dispatch on type/. We can think of the system
as having three parts: Ben, Alyssa, and the manager. The idea is that
you break your system into a bunch of pieces. There is Ben and Alyssa,
who are making representations, and then there is the manager, who
looks at the types on the data and /dispatches/ tasks to the right
person.

