blog/21.html

<div id="outline-container-orgd600812" class="outline-2">
<h2 id="orgd600812">2.4.2 Tagged data</h2>
<div class="outline-text-2" id="text-orgd600812">
<p>
Now, what if don't want to choose one representation over the other?
What if we want to keep both representations? What if we want a system
that looks like that figure 2.19?
</p>

<p>
If our system has to include multiple representations for the same
object type, then we need some way to distinguish objects with
representation foo from objects with representation bar. A simple way
to do that is <i>tagging</i> the objects. To tag and check the tags we can
do something like this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">attach-tag</span> type-tag contents)
  (cons type-tag contents))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">type-tag</span> datum)
  (<span style="color: #531ab6;">if</span> (pair? datum)
      (car datum)
      (error <span style="color: #3548cf;">"Bad tagged datum -- TYPE-TAG"</span> datum)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">contents</span> datum)
  (<span style="color: #531ab6;">if</span> (pair? datum)
      (cdr datum)
      (error <span style="color: #3548cf;">"Bad tagged datum -- CONTENTS"</span> datum)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rectangular?</span> z)
  (eq? (type-tag z) 'rectangular))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">polar?</span> z)
  (eq? (type-tag z) 'polar))
</pre>
</div>

<p>
If Ben and Alyssa have a designed their representation packages
separately, what would they have to do to exist compatibly in the
system? Here is what they can do. Ben can write his representation in
this way:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part-rectangular</span> z) (car z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part-rectangular</span> z) (cdr z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude-rectangular</span> z)
  (sqrt (+ (square (real-part-rectangular z))
           (square (imag-part-rectangular z)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle-rectangular</span> z)
  (atan (imag-part-rectangular z)
        (real-part-rectangular z)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag-rectangular</span> x y)
  (attach-tag 'rectangular (cons x y)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang-rectangular</span> r a)
  (attach-tag 'rectangular
              (cons (* r (cos a)) (* r (sin a)))))
</pre>
</div>

<p>
And Alyssa can write her representation in this way:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part-polar</span> z)
  (* (magnitude-polar z) (cos (angle-polar z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part-polar</span> z)
  (* (magnitude-polar z) (sin (angle-polar z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude-polar</span> z) (car z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle-polar</span> z) (cdr z))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag-polar</span> x y)
  (attach-tag 'polar
              (cons (sqrt (+ (square x) (square y)))
                    (atan y x))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang-polar</span> r a)
  (attach-tag 'polar (cons r a)))
</pre>
</div>

<p>
These ``packages'' differ from the original packages in two respects:
</p>
<ol class="org-ol">
<li>the constructor is now tagging the objects it creates;</li>
<li>the function names have been modified in order to avoid name
conflicts (for example, in Ben's representation, <code>real-part</code> has
become <code>real-part-rectangular</code>).</li>
</ol>

<p>
Now that we have been given typed data, we need somebody, say a
``manager'' (see lecture), that looks at those types and make things
work. The manager can now write <i>generic</i> selectors:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part</span> z)
  (<span style="color: #531ab6;">cond</span> ((rectangular? z)
         (real-part-rectangular (contents z)))
        ((polar? z)
         (real-part-polar (contents z)))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown type -- REAL-PART"</span> z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part</span> z)
  (<span style="color: #531ab6;">cond</span> ((rectangular? z)
         (imag-part-rectangular (contents z)))
        ((polar? z)
         (imag-part-polar (contents z)))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown type -- IMAG-PART"</span> z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z)
  (<span style="color: #531ab6;">cond</span> ((rectangular? z)
         (magnitude-rectangular (contents z)))
        ((polar? z)
         (magnitude-polar (contents z)))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown type -- MAGNITUDE"</span> z))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle</span> z)
  (<span style="color: #531ab6;">cond</span> ((rectangular? z)
         (angle-rectangular (contents z)))
        ((polar? z)
         (angle-polar (contents z)))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown type -- ANGLE"</span> z))))
</pre>
</div>

<p>
This strategy is called <i>dispatch on type</i>. We can think of the system
as having three parts: Ben, Alyssa, and the manager. The idea is that
you break your system into a bunch of pieces. There is Ben and Alyssa,
who are making representations, and then there is the manager, who
looks at the types on the data and <i>dispatches</i> tasks to the right
person.
</p>
</div>
</div>
