blog/21.org
* 2.4.3 Data-Directed Programming and Additivity
How can we criticize the system described above? First, Ben and Alyssa
had to change the names of their procedures. Second, when somebody
wants to add a representation into the system, even if Ben and Alyssa
don't care, whoever is in charge of the generic selectors --- the
manager, in our narrative ---, has to change all of them!

(Roughly, from the lecture:) ``The inflexibility in the system, the
place where work has to be done to accommodate is in the manager.
That's quite annoying. It's even more annoying when you think that the
manager isn't really doing anything... the bottleneck in the system is
in the bureaucracy...''

Now, abstractly, in the system, there is a table:

|           | polar           | rectangular           |
|-----------+-----------------+-----------------------|
| real-part | real-part-polar | real-part-rectangular |
|-----------+-----------------+-----------------------|
| imag-part | imag-part-polar | imag-part-rectangular |
|-----------+-----------------+-----------------------|
| magnitude | magnitude-polar | magnitude-rectangular |
|-----------+-----------------+-----------------------|
| angle     | angle-polar     | angle-rectangular     |
    
In the table we have the right procedures for the given types
(columns) and operators (rows). ``That's really what's going on. In
some sense, all the manager is doing is acting as this table''.

How do we fix our system? We get rid of the manager. We let our system
use the table directly. How do we do that? Let's assume --- again,
data abstraction! --- that we have some sort of table data structure
in which we can put things:

#+begin_src scheme
  `(put <OP> <TYPE> <ITEM>)' installs the `<ITEM>' in the table,
  indexed by the `<OP>' and the `<TYPE>'.

  `(get <OP> <TYPE>)' looks up the `<OP>', `<TYPE>' entry in the
  table and returns the item found there.  If no item is found,
  `get' returns false.
#+end_src

Given that we have this table, now Ben and Alyssa, when they build
their systems, can fill the table appropriately:

Ben:
#+begin_src scheme
  (define (install-rectangular-package)
    ;; internal procedures
    (define (real-part z) (car z))
    (define (imag-part z) (cdr z))
    (define (make-from-real-imag x y) (cons x y))
    (define (magnitude z)
      (sqrt (+ (square (real-part z))
               (square (imag-part z)))))
    (define (angle z)
      (atan (imag-part z) (real-part z)))
    (define (make-from-mag-ang r a)
      (cons (* r (cos a)) (* r (sin a))))

    ;; interface to the rest of the system
    (define (tag x) (attach-tag 'rectangular x))
    (put 'real-part '(rectangular) real-part)
    (put 'imag-part '(rectangular) imag-part)
    (put 'magnitude '(rectangular) magnitude)
    (put 'angle '(rectangular) angle)
    (put 'make-from-real-imag 'rectangular
         (lambda (x y) (tag (make-from-real-imag x y))))
    (put 'make-from-mag-ang 'rectangular
         (lambda (r a) (tag (make-from-mag-ang r a))))
    'done)
#+end_src

Alyssa:
#+begin_src scheme
  (define (install-polar-package)
    ;; internal procedures
    (define (magnitude z) (car z))
    (define (angle z) (cdr z))
    (define (make-from-mag-ang r a) (cons r a))
    (define (real-part z)
      (* (magnitude z) (cos (angle z))))
    (define (imag-part z)
      (* (magnitude z) (sin (angle z))))
    (define (make-from-real-imag x y)
      (cons (sqrt (+ (square x) (square y)))
            (atan y x)))

    ;; interface to the rest of the system
    (define (tag x) (attach-tag 'polar x))
    (put 'real-part '(polar) real-part)
    (put 'imag-part '(polar) imag-part)
    (put 'magnitude '(polar) magnitude)
    (put 'angle '(polar) angle)
    (put 'make-from-real-imag 'polar
         (lambda (x y) (tag (make-from-real-imag x y))))
    (put 'make-from-mag-ang 'polar
         (lambda (r a) (tag (make-from-mag-ang r a))))
    'done)
#+end_src

Who makes a representation has the responsibility of setting up a
column in the table. The manager has been ``automated out of
existence''. The manager is replaced by a procedure. This procedure is
called ~apply-generic~ and is the key procedure in the whole system
(see also its simpler version ~operate~ shown in the lecture).

#+begin_src scheme
  (define (apply-generic op . args)
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
        (if proc
            (apply proc (map contents args))
            (error
             "No method for these types -- APPLY-GENERIC"
             (list op type-tags))))))
#+end_src

We use ~apply-generic~ to define the generic selectors:

#+begin_src scheme
  (define (real-part z) (apply-generic 'real-part z))
  (define (imag-part z) (apply-generic 'imag-part z))
  (define (magnitude z) (apply-generic 'magnitude z))
  (define (angle z) (apply-generic 'angle z))
#+end_src

This strategy is called ``data-directed programming'', because, ``in
some sense the data objects themselves are carrying with them the
information about how you should operate on them''.

