blog/21.html

<div id="outline-container-orgfe3a705" class="outline-2">
<h2 id="orgfe3a705">2.4.3 Data-Directed Programming and Additivity</h2>
<div class="outline-text-2" id="text-orgfe3a705">
<p>
How can we criticize the system described above? First, Ben and Alyssa
had to change the names of their procedures. Second, when somebody
wants to add a representation into the system, even if Ben and Alyssa
don't care, whoever is in charge of the generic selectors &#x2014; the
manager, in our narrative &#x2014;, has to change all of them!
</p>

<p>
(Roughly, from the lecture:) ``The inflexibility in the system, the
place where work has to be done to accommodate is in the manager.
That's quite annoying. It's even more annoying when you think that the
manager isn't really doing anything&#x2026; the bottleneck in the system is
in the bureaucracy&#x2026;''
</p>

<p>
Now, abstractly, in the system, there is a table:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">polar</th>
<th scope="col" class="org-left">rectangular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">real-part</td>
<td class="org-left">real-part-polar</td>
<td class="org-left">real-part-rectangular</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">imag-part</td>
<td class="org-left">imag-part-polar</td>
<td class="org-left">imag-part-rectangular</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">magnitude</td>
<td class="org-left">magnitude-polar</td>
<td class="org-left">magnitude-rectangular</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">angle</td>
<td class="org-left">angle-polar</td>
<td class="org-left">angle-rectangular</td>
</tr>
</tbody>
</table>

<p>
In the table we have the right procedures for the given types
(columns) and operators (rows). ``That's really what's going on. In
some sense, all the manager is doing is acting as this table''.
</p>

<p>
How do we fix our system? We get rid of the manager. We let our system
use the table directly. How do we do that? Let's assume &#x2014; again,
data abstraction! &#x2014; that we have some sort of table data structure
in which we can put things:
</p>

<div class="org-src-container">
<pre class="src src-scheme">`(put <span style="color: #005f5f;">&lt;OP&gt;</span> <span style="color: #005f5f;">&lt;TYPE&gt;</span> <span style="color: #005f5f;">&lt;ITEM&gt;</span>)' installs the `<span style="color: #005f5f;">&lt;ITEM&gt;</span>' in the table,
indexed by the `<span style="color: #005f5f;">&lt;OP&gt;</span>' and the `<span style="color: #005f5f;">&lt;TYPE&gt;</span>'.

`(get <span style="color: #005f5f;">&lt;OP&gt;</span> <span style="color: #005f5f;">&lt;TYPE&gt;</span>)' looks up the `<span style="color: #005f5f;">&lt;OP&gt;</span>', `<span style="color: #005f5f;">&lt;TYPE&gt;</span>' entry in the
table and returns the item found there.  If no item is found,
`get' returns false.
</pre>
</div>

<p>
Given that we have this table, now Ben and Alyssa, when they build
their systems, can fill the table appropriately:
</p>

<p>
Ben:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">install-rectangular-package</span>)
  <span style="color: #595959;">;; </span><span style="color: #595959;">internal procedures</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part</span> z) (car z))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part</span> z) (cdr z))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag</span> x y) (cons x y))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z)
    (sqrt (+ (square (real-part z))
             (square (imag-part z)))))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle</span> z)
    (atan (imag-part z) (real-part z)))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang</span> r a)
    (cons (* r (cos a)) (* r (sin a))))

  <span style="color: #595959;">;; </span><span style="color: #595959;">interface to the rest of the system</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tag</span> x) (attach-tag 'rectangular x))
  (put 'real-part '(rectangular) real-part)
  (put 'imag-part '(rectangular) imag-part)
  (put 'magnitude '(rectangular) magnitude)
  (put 'angle '(rectangular) angle)
  (put 'make-from-real-imag 'rectangular
       (<span style="color: #531ab6;">lambda</span> (x y) (tag (make-from-real-imag x y))))
  (put 'make-from-mag-ang 'rectangular
       (<span style="color: #531ab6;">lambda</span> (r a) (tag (make-from-mag-ang r a))))
  'done)
</pre>
</div>

<p>
Alyssa:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">install-polar-package</span>)
  <span style="color: #595959;">;; </span><span style="color: #595959;">internal procedures</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z) (car z))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle</span> z) (cdr z))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang</span> r a) (cons r a))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part</span> z)
    (* (magnitude z) (cos (angle z))))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part</span> z)
    (* (magnitude z) (sin (angle z))))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag</span> x y)
    (cons (sqrt (+ (square x) (square y)))
          (atan y x)))

  <span style="color: #595959;">;; </span><span style="color: #595959;">interface to the rest of the system</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tag</span> x) (attach-tag 'polar x))
  (put 'real-part '(polar) real-part)
  (put 'imag-part '(polar) imag-part)
  (put 'magnitude '(polar) magnitude)
  (put 'angle '(polar) angle)
  (put 'make-from-real-imag 'polar
       (<span style="color: #531ab6;">lambda</span> (x y) (tag (make-from-real-imag x y))))
  (put 'make-from-mag-ang 'polar
       (<span style="color: #531ab6;">lambda</span> (r a) (tag (make-from-mag-ang r a))))
  'done)
</pre>
</div>

<p>
Who makes a representation has the responsibility of setting up a
column in the table. The manager has been ``automated out of
existence''. The manager is replaced by a procedure. This procedure is
called <code>apply-generic</code> and is the key procedure in the whole system
(see also its simpler version <code>operate</code> shown in the lecture).
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-generic</span> op . args)
  (<span style="color: #531ab6;">let</span> ((type-tags (<span style="color: #531ab6;">map</span> type-tag args)))
    (<span style="color: #531ab6;">let</span> ((proc (get op type-tags)))
      (<span style="color: #531ab6;">if</span> proc
          (apply proc (<span style="color: #531ab6;">map</span> contents args))
          (error
           <span style="color: #3548cf;">"No method for these types -- APPLY-GENERIC"</span>
           (list op type-tags))))))
</pre>
</div>

<p>
We use <code>apply-generic</code> to define the generic selectors:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">real-part</span> z) (apply-generic 'real-part z))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">imag-part</span> z) (apply-generic 'imag-part z))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z) (apply-generic 'magnitude z))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">angle</span> z) (apply-generic 'angle z))
</pre>
</div>

<p>
This strategy is called ``data-directed programming'', because, ``in
some sense the data objects themselves are carrying with them the
information about how you should operate on them''.
</p>
</div>
