blog/21.org
** Exercise 2.74
*Exercise*:
#+begin_quote
Insatiable Enterprises, Inc., is a highly decentralized conglomerate
company consisting of a large number of independent divisions located
all over the world. The company's computer facilities have just been
interconnected by means of a clever network-interfacing scheme that
makes the entire network appear to any user to be a single computer.
Insatiable's president, in her first attempt to exploit the ability of
the network to extract administrative information from division files,
is dismayed to discover that, although all the division files have
been implemented as data structures in Scheme, the particular data
structure used varies from division to division. A meeting of division
managers is hastily called to search for a strategy to integrate the
files that will satisfy headquarters' needs while preserving the
existing autonomy of the divisions.

Show how such a strategy can be implemented with data-directed
programming. As an example, suppose that each division's personnel
records consist of a single file, which contains a set of records
keyed on employees' names. The structure of the set varies from
division to division. Furthermore, each employee's record is itself a
set (structured differently from division to division) that contains
information keyed under identifiers such as ~address~ and ~salary~. In
particular:

a. Implement for headquarters a ~get-record~ procedure that retrieves
a specified employee's record from a specified personnel file. The
procedure should be applicable to any division's file. Explain how the
individual divisions' files should be structured. In particular, what
type information must be supplied?

b. Implement for headquarters a ~get-salary~ procedure that returns
the salary information from a given employee's record from any
division's personnel file. How should the record be structured in
order to make this operation work?

c. Implement for headquarters a ~find-employee-record~ procedure. This
should search all the divisions' files for the record of a given
employee and return the record. Assume that this procedure takes as
arguments an employee's name and a list of all the divisions' files.

d. When Insatiable takes over a new company, what changes must be made
in order to incorporate the new personnel information into the central
system?
#+end_quote

*Answer*:

*** a.
A generic ~get-record~ procedure could be implemented as follows:
#+begin_src scheme
  (define (get-record personnel-file name)
    (apply-generic 'get-record personnel-file name))
#+end_src


Division1 (and, analogously, other divisions) could provide its
package like that:

#+begin_src scheme
  (define (install-division1-package)
    ;; internal procedures
    (define (get-record file employee-name)
      ;; ...
      )

    ;; constructors
    ;; ...

    ;; interface to the rest of the system
    (define (tag-file x) (attach-tag 'division1 x))
    (define (tag-employee-name x) (attach-tag 'employee-name-division1 x))
    (define (tag-employee x) (attach-tag 'employee-division1 x))

    (put 'get-record '(division1 employee-name-division1) get-record))
#+end_src

[Should employee-name1 be typed data? Couldn't it be just a non-typed
string]
*** b.
Headquarters could use this procedure:
#+begin_src scheme
  (define (get-salary employee-record)
    (apply-generic 'get-salary employee-record))
#+end_src

Division1 (and, analogously, the other divisions) could provide their
version of ~get-salary~ procedures in the following ways:
#+begin_src scheme
  (define (install-division1-package)
    ;;...

    (define (get-salary employee-name)
      ;; 
      )

    ;...

    ;; interface to the rest of the system
    ;; ..

    (put 'get-salary '(employee-division1) get-salary))
#+end_src
*** c
#+begin_src scheme
(define (find-employee-record name divisions)
    (if (null? divisions)
        nil
        (or (get-record name (car divisions))
            (find-employee-record name (cdr divisions)))))
#+end_src
*** d
Somebody has fill the table with the relevant new methods.
~get-record~, ~get-salary~, and ~find-employee-record~ remain the way
they are.

** Message Passing
Data-directed programming makes use of a operation-and-type table.

The first method we have seen --- generic operations with explicit
dispatch --- can be thought of as decomposing that table ``into rows,
with each generic operation procedure representing a row of the
table.''

There is at least a third alternative, known as ``message passing'',
which consists in decomposing the table into type columns only:
#+begin_quote
instead of using "intelligent operations" that dispatch on data types,
to work with "intelligent data objects" that dispatch on operation
names.
#+end_quote

Here is how we could write ~make-from-real-imag~ following such an
approach:
#+begin_src scheme
  (define (make-from-real-imag x y)
    (define (dispatch op)
      (cond ((eq? op 'real-part) x)
            ((eq? op 'imag-part) y)
            ((eq? op 'magnitude)
             (sqrt (+ (square x) (square y))))
            ((eq? op 'angle) (atan y x))
            (else
             (error "Unknown op -- MAKE-FROM-REAL-IMAG" op))))
    dispatch)
#+end_src

And here is how ~apply-generic~ would look like:
#+begin_src scheme
  (define (apply-generic op arg) (arg op))
#+end_src

#+begin_quote
The name comes from the image that a data object is an entity that
receives the requested operation name as a "message."
#+end_quote

** Exercise 2.75
*Exercise*:
#+begin_quote
Implement the constructor `make-from-mag-ang' in message-passing
style. This procedure should be analogous to the `make-from-real-imag'
procedure given above.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (make-from-mag-ang r a)
    (define (dispatch op)
      (cond ((eq? op 'real-part) (* r (cos a)))
            ((eq? op 'imag-part) (* r (sin a)))
            ((eq? op 'magnitude) r)
            ((eq? op 'angle) a)
            (else (error "Unknown op - MAKE-FROM-MAG-ANG" op))))
    dispatch)
#+end_src

