blog/21.html

<div id="outline-container-org308e6af" class="outline-3">
<h3 id="org308e6af">Exercise 2.74</h3>
<div class="outline-text-3" id="text-org308e6af">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Insatiable Enterprises, Inc., is a highly decentralized conglomerate
company consisting of a large number of independent divisions located
all over the world. The company's computer facilities have just been
interconnected by means of a clever network-interfacing scheme that
makes the entire network appear to any user to be a single computer.
Insatiable's president, in her first attempt to exploit the ability of
the network to extract administrative information from division files,
is dismayed to discover that, although all the division files have
been implemented as data structures in Scheme, the particular data
structure used varies from division to division. A meeting of division
managers is hastily called to search for a strategy to integrate the
files that will satisfy headquarters' needs while preserving the
existing autonomy of the divisions.
</p>

<p>
Show how such a strategy can be implemented with data-directed
programming. As an example, suppose that each division's personnel
records consist of a single file, which contains a set of records
keyed on employees' names. The structure of the set varies from
division to division. Furthermore, each employee's record is itself a
set (structured differently from division to division) that contains
information keyed under identifiers such as <code>address</code> and <code>salary</code>. In
particular:
</p>

<p>
a. Implement for headquarters a <code>get-record</code> procedure that retrieves
a specified employee's record from a specified personnel file. The
procedure should be applicable to any division's file. Explain how the
individual divisions' files should be structured. In particular, what
type information must be supplied?
</p>

<p>
b. Implement for headquarters a <code>get-salary</code> procedure that returns
the salary information from a given employee's record from any
division's personnel file. How should the record be structured in
order to make this operation work?
</p>

<p>
c. Implement for headquarters a <code>find-employee-record</code> procedure. This
should search all the divisions' files for the record of a given
employee and return the record. Assume that this procedure takes as
arguments an employee's name and a list of all the divisions' files.
</p>

<p>
d. When Insatiable takes over a new company, what changes must be made
in order to incorporate the new personnel information into the central
system?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
</div>

<div id="outline-container-orgf047d97" class="outline-4">
<h4 id="orgf047d97">a.</h4>
<div class="outline-text-4" id="text-orgf047d97">
<p>
A generic <code>get-record</code> procedure could be implemented as follows:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-record</span> personnel-file name)
  (apply-generic 'get-record personnel-file name))
</pre>
</div>


<p>
Division1 (and, analogously, other divisions) could provide its
package like that:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">install-division1-package</span>)
  <span style="color: #595959;">;; </span><span style="color: #595959;">internal procedures</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-record</span> file employee-name)
    <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
    )

  <span style="color: #595959;">;; </span><span style="color: #595959;">constructors</span>
  <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>

  <span style="color: #595959;">;; </span><span style="color: #595959;">interface to the rest of the system</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tag-file</span> x) (attach-tag 'division1 x))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tag-employee-name</span> x) (attach-tag 'employee-name-division1 x))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tag-employee</span> x) (attach-tag 'employee-division1 x))

  (put 'get-record '(division1 employee-name-division1) get-record))
</pre>
</div>

<p>
[Should employee-name1 be typed data? Couldn't it be just a non-typed
string]
</p>
</div>
</div>
<div id="outline-container-orgb588f2b" class="outline-4">
<h4 id="orgb588f2b">b.</h4>
<div class="outline-text-4" id="text-orgb588f2b">
<p>
Headquarters could use this procedure:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-salary</span> employee-record)
  (apply-generic 'get-salary employee-record))
</pre>
</div>

<p>
Division1 (and, analogously, the other divisions) could provide their
version of <code>get-salary</code> procedures in the following ways:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">install-division1-package</span>)
  <span style="color: #595959;">;;</span><span style="color: #595959;">...</span>

  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">get-salary</span> employee-name)
    <span style="color: #595959;">;; </span>
    )

  <span style="color: #595959;">;</span><span style="color: #595959;">...</span>

  <span style="color: #595959;">;; </span><span style="color: #595959;">interface to the rest of the system</span>
  <span style="color: #595959;">;; </span><span style="color: #595959;">..</span>

  (put 'get-salary '(employee-division1) get-salary))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0d5ae1d" class="outline-4">
<h4 id="org0d5ae1d">c</h4>
<div class="outline-text-4" id="text-org0d5ae1d">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">find-employee-record</span> name divisions)
    (<span style="color: #531ab6;">if</span> (null? divisions)
        nil
        (<span style="color: #531ab6;">or</span> (get-record name (car divisions))
            (find-employee-record name (cdr divisions)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org89e53bb" class="outline-4">
<h4 id="org89e53bb">d</h4>
<div class="outline-text-4" id="text-org89e53bb">
<p>
Somebody has fill the table with the relevant new methods.
<code>get-record</code>, <code>get-salary</code>, and <code>find-employee-record</code> remain the way
they are.
</p>
</div>
</div>
</div>

<div id="outline-container-org1960de1" class="outline-3">
<h3 id="org1960de1">Message Passing</h3>
<div class="outline-text-3" id="text-org1960de1">
<p>
Data-directed programming makes use of a operation-and-type table.
</p>

<p>
The first method we have seen &#x2014; generic operations with explicit
dispatch &#x2014; can be thought of as decomposing that table ``into rows,
with each generic operation procedure representing a row of the
table.''
</p>

<p>
There is at least a third alternative, known as ``message passing'',
which consists in decomposing the table into type columns only:
</p>
<blockquote>
<p>
instead of using "intelligent operations" that dispatch on data types,
to work with "intelligent data objects" that dispatch on operation
names.
</p>
</blockquote>

<p>
Here is how we could write <code>make-from-real-imag</code> following such an
approach:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-real-imag</span> x y)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> op)
    (<span style="color: #531ab6;">cond</span> ((eq? op 'real-part) x)
          ((eq? op 'imag-part) y)
          ((eq? op 'magnitude)
           (sqrt (+ (square x) (square y))))
          ((eq? op 'angle) (atan y x))
          (<span style="color: #531ab6;">else</span>
           (error <span style="color: #3548cf;">"Unknown op -- MAKE-FROM-REAL-IMAG"</span> op))))
  dispatch)
</pre>
</div>

<p>
And here is how <code>apply-generic</code> would look like:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-generic</span> op arg) (arg op))
</pre>
</div>

<blockquote>
<p>
The name comes from the image that a data object is an entity that
receives the requested operation name as a "message."
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd57a3b7" class="outline-3">
<h3 id="orgd57a3b7">Exercise 2.75</h3>
<div class="outline-text-3" id="text-orgd57a3b7">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Implement the constructor `make-from-mag-ang' in message-passing
style. This procedure should be analogous to the `make-from-real-imag'
procedure given above.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-from-mag-ang</span> r a)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> op)
    (<span style="color: #531ab6;">cond</span> ((eq? op 'real-part) (* r (cos a)))
          ((eq? op 'imag-part) (* r (sin a)))
          ((eq? op 'magnitude) r)
          ((eq? op 'angle) a)
          (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown op - MAKE-FROM-MAG-ANG"</span> op))))
  dispatch)
</pre>
</div>
</div>
</div>
