blog/21.org
** Exercise 2.76
*Exercise*:
#+begin_quote
As a large system with generic operations evolves, new types of data
objects or new operations may be needed. For each of the three
strategies --- generic operations with explicit dispatch,
data-directed style, and message-passing-style --- describe the
changes that must be made to a system in order to add new types or new
operations. Which organization would be most appropriate for a system
in which new types must often be added? Which would be most
appropriate for a system in which new operations must often be added?
#+end_quote

*Answer*:

*** Generic operations with explicit dispatch
**** Adding a new type
Let's imagine Henry wants to add his representation to the complex
number arithmetic system.

Somebody (the ``manager''...) has to change all generic operators.
~real-part~, ~imag-part~, ~magnitude~, ~angle~, now need an additonal
check for Henry's representation. Moreover, Henry should make sure
that the names of his procedures don't conflict with those used by Ben
and Alyssa.
**** Adding a new operation
Suppose we need a ~get-foo~ operation.

All of those in charge of maintaining representation (Ben, Alyssa, and
Henry) have to write a method that performs the right operation when
their their representation is used. And, again, name conflict is to be
avoided.

Moreover, somebody (the ``manager''...) has to write a generic
~get-foo~ operation. In order to do so, he has to know all the names
of the procedures written by Ben, Alyssa, and Henry.
*** Data-directed Programming
**** Adding a new type
Again, let's imagine that Henry wants to add his representation to the
complex number arithmetic system we already have.

Henry, in data-directed system, has to ``install'' his packaged, that
is, he has to put his procedures into the table.

By following the method shown at p. ? he doesn't have to worry about
name conflict (That method exploits scope. There are other ways as
well; for example, putting lambdas into the table; see the video
lecture. The table stores objects, not names).

There is now no work for the ``manager''. The manager has been
``automated out of existence'' (see the lecture). The generic
operations we already have will do the right thing thanks to
~apply-generic~ (or its simpler version ~operate~ shown in the
lecture).
**** Adding a new operation
Again, suppose we need a ~get-foo~ operation.

Somebody has to write a generic ~get-foo~.

However, unlike with generic operations with explicit dispatch, now we
don't need to know anything besides the name of the operation we want
to add.

Each package maintainer will have the responsibility to add their
version of ~get-foo~ to the table. However, in case one doesn't and we
try to ~get-foo~ to complex number of their type, the generic
operation will show a suitable error message.
*** Message passing
**** Adding a new type
Again, let's imagine that Henry wants to add his representation to the
complex number arithmetic system we already have.

Henry just as to add a new constructor. The situation is somewhat
analogous to the data-directed programming case.
**** Adding a new operation
Again, suppose we need a ~get-foo~ operation.

Somebody has to write the generic operation ~get-foo~, like in
data-directed programming.

Moreover, each ``package maintainers'' will have to add their version
of ~get-foo~ in the ~dispatch~ procedure. In this case as well, if
somebody forgets to add the relevant procedure, an error message is
printed when we apply ~get-foo~ on the relevant object.
*** Conclusions
#+begin_quote
Which organization would be most appropriate for a system
in which new types must often be added?
#+end_quote

Either data-directed programming or message passing. As far as I can
now see, they are both superior, in this respect, to generic
operations with explicit dispatch, but none of them is obviously
better than the other.

#+begin_quote
Which would be most appropriate for a system in which new operations
must often be added?
#+end_quote

I would give the same answer: either data-directed programming or
message passing. As far as I can now see, they are both superior, in
this respect, to generic operations with explicit dispatch, but none
of them is obviously better than the other.

#+begin_export html
<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
#+end_export
