blog/21.html

<div id="outline-container-org8210486" class="outline-3">
<h3 id="org8210486">Exercise 2.76</h3>
<div class="outline-text-3" id="text-org8210486">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
As a large system with generic operations evolves, new types of data
objects or new operations may be needed. For each of the three
strategies &#x2014; generic operations with explicit dispatch,
data-directed style, and message-passing-style &#x2014; describe the
changes that must be made to a system in order to add new types or new
operations. Which organization would be most appropriate for a system
in which new types must often be added? Which would be most
appropriate for a system in which new operations must often be added?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
</div>

<div id="outline-container-org146b9f0" class="outline-4">
<h4 id="org146b9f0">Generic operations with explicit dispatch</h4>
<div class="outline-text-4" id="text-org146b9f0">
</div>
<ul class="org-ul">
<li><a id="org312ff30"></a>Adding a new type<br />
<div class="outline-text-5" id="text-org312ff30">
<p>
Let's imagine Henry wants to add his representation to the complex
number arithmetic system.
</p>

<p>
Somebody (the ``manager''&#x2026;) has to change all generic operators.
<code>real-part</code>, <code>imag-part</code>, <code>magnitude</code>, <code>angle</code>, now need an additonal
check for Henry's representation. Moreover, Henry should make sure
that the names of his procedures don't conflict with those used by Ben
and Alyssa.
</p>
</div>
</li>
<li><a id="org0319cb9"></a>Adding a new operation<br />
<div class="outline-text-5" id="text-org0319cb9">
<p>
Suppose we need a <code>get-foo</code> operation.
</p>

<p>
All of those in charge of maintaining representation (Ben, Alyssa, and
Henry) have to write a method that performs the right operation when
their their representation is used. And, again, name conflict is to be
avoided.
</p>

<p>
Moreover, somebody (the ``manager''&#x2026;) has to write a generic
<code>get-foo</code> operation. In order to do so, he has to know all the names
of the procedures written by Ben, Alyssa, and Henry.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb288c32" class="outline-4">
<h4 id="orgb288c32">Data-directed Programming</h4>
<div class="outline-text-4" id="text-orgb288c32">
</div>
<ul class="org-ul">
<li><a id="org5e90545"></a>Adding a new type<br />
<div class="outline-text-5" id="text-org5e90545">
<p>
Again, let's imagine that Henry wants to add his representation to the
complex number arithmetic system we already have.
</p>

<p>
Henry, in data-directed system, has to ``install'' his packaged, that
is, he has to put his procedures into the table.
</p>

<p>
By following the method shown at p. ? he doesn't have to worry about
name conflict (That method exploits scope. There are other ways as
well; for example, putting lambdas into the table; see the video
lecture. The table stores objects, not names).
</p>

<p>
There is now no work for the ``manager''. The manager has been
``automated out of existence'' (see the lecture). The generic
operations we already have will do the right thing thanks to
<code>apply-generic</code> (or its simpler version <code>operate</code> shown in the
lecture).
</p>
</div>
</li>
<li><a id="orgbac7bed"></a>Adding a new operation<br />
<div class="outline-text-5" id="text-orgbac7bed">
<p>
Again, suppose we need a <code>get-foo</code> operation.
</p>

<p>
Somebody has to write a generic <code>get-foo</code>.
</p>

<p>
However, unlike with generic operations with explicit dispatch, now we
don't need to know anything besides the name of the operation we want
to add.
</p>

<p>
Each package maintainer will have the responsibility to add their
version of <code>get-foo</code> to the table. However, in case one doesn't and we
try to <code>get-foo</code> to complex number of their type, the generic
operation will show a suitable error message.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8447257" class="outline-4">
<h4 id="org8447257">Message passing</h4>
<div class="outline-text-4" id="text-org8447257">
</div>
<ul class="org-ul">
<li><a id="orgf6a3701"></a>Adding a new type<br />
<div class="outline-text-5" id="text-orgf6a3701">
<p>
Again, let's imagine that Henry wants to add his representation to the
complex number arithmetic system we already have.
</p>

<p>
Henry just as to add a new constructor. The situation is somewhat
analogous to the data-directed programming case.
</p>
</div>
</li>
<li><a id="orgec7ae07"></a>Adding a new operation<br />
<div class="outline-text-5" id="text-orgec7ae07">
<p>
Again, suppose we need a <code>get-foo</code> operation.
</p>

<p>
Somebody has to write the generic operation <code>get-foo</code>, like in
data-directed programming.
</p>

<p>
Moreover, each ``package maintainers'' will have to add their version
of <code>get-foo</code> in the <code>dispatch</code> procedure. In this case as well, if
somebody forgets to add the relevant procedure, an error message is
printed when we apply <code>get-foo</code> on the relevant object.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org850c4d4" class="outline-4">
<h4 id="org850c4d4">Conclusions</h4>
<div class="outline-text-4" id="text-org850c4d4">
<blockquote>
<p>
Which organization would be most appropriate for a system
in which new types must often be added?
</p>
</blockquote>

<p>
Either data-directed programming or message passing. As far as I can
now see, they are both superior, in this respect, to generic
operations with explicit dispatch, but none of them is obviously
better than the other.
</p>

<blockquote>
<p>
Which would be most appropriate for a system in which new operations
must often be added?
</p>
</blockquote>

<p>
I would give the same answer: either data-directed programming or
message passing. As far as I can now see, they are both superior, in
this respect, to generic operations with explicit dispatch, but none
of them is obviously better than the other.
</p>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">A
cool way to represent pairs using procedures only is shown on page
91.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</span></p>
</div>
</body>
</html>